app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-09-25 19:36:42.549645"], ["id", 2]]
---
def update
  @post = Post.find(params[:id])
  byebug
  @post.update(title: params[:title], description: params[:description])